$(function () {
    var province = {
        'A':['安徽', '澳门'], 'B':['北京'], 'C':['重庆'], 'F':['福建'], 'G':['国外','广东','广西','甘肃','贵州'], 'H':['河北','河南','海南','湖北','湖南','黑龙江'], 'J':['吉林','江苏','江西'], 'L':['辽宁'], 'N':['内蒙古','宁夏'], 'Q':['青海'], 'S':['上海','四川','山东','山西','陕西'], 'T':['天津','台湾'], 'X':['新疆','西藏','香港'], 'Y':['云南'], 'Z':['浙江','中国未识别地区'],
    };

    var city = {
        '安徽':['亳州','六安','合肥','安庆','宣城','宿州','巢湖','池州','淮北','淮南','滁州','芜湖','蚌埠','铜陵','阜阳','马鞍山','黄山','未识别地区'],
        '澳门':['澳门'],
        '北京':['北京'],
        '重庆':['重庆'],
        '福建':['三明','南平','厦门','宁德','泉州','漳州','福州','莆田','龙岩','未识别地区'],
        '国外':['请选择'],
        '广东':['东莞','中山','云浮','佛山','广州','惠州','揭阳','梅州','汕头','汕尾','江门','河源','深圳','清远','湛江','潮州','珠海','肇庆','茂名','阳江','韶关','未识别地区'],
        '广西':['北海','南宁','崇左','来宾','柳州','桂林','梧州','河池','玉林','百色','贵港','贺州','钦州','防城港','未识别地区'],
        '甘肃':['临夏','兰州','嘉峪关','天水','定西','平凉','庆阳','张掖','武威','甘南','白银','酒泉','金昌','陇南','未识别地区'],
        '贵州':['六盘水','安顺','毕节','贵阳','遵义','铜仁','黔东南','黔南','黔西南','未识别地区'],
        '河北':['保定','唐山','廊坊','张家口','承德','沧州','石家庄','秦皇岛','衡水','邢台','邯郸','未识别地区'],
        '河南':['三门峡','信阳','南阳','周口','商丘','安阳','平顶山','开封','新乡','洛阳','济源','漯河','濮阳','焦作','许昌','郑州','驻马店','鹤壁','未识别地区'],
        '海南':['万宁','三亚','东方','临高县','五指山','保亭黎族苗族自治县','儋州','定安县','文昌','昌江黎族自治县','海口','澄迈县','琼海','白沙黎族自治县','陵水黎族自治县','未识别地区'],
        '湖北':['仙桃','十堰','咸宁','天门','商丘','孝感','宜昌','恩施','武汉','潜江','神农架','荆州','荆门','襄樊','鄂州','随州','黄冈','黄石','未识别地区'],
        '湖南':['娄底','岳阳','常德','张家界','怀化','株洲','永州','湘潭','湘西','益阳','衡阳','邵阳','郴州','长沙','未识别地区'],
        '黑龙江':["哈尔滨", "齐齐哈尔", "鸡西", "牡丹江", "佳木斯", "大庆", "伊春", "黑河", "大兴安岭"],
        '吉林':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '江苏':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '江西':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '辽宁':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '内蒙古':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '宁夏':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '青海':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '上海':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '四川':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '山东':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '山西':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '陕西':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '天津':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '台湾':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '新疆':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '西藏':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '香港':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '云南':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '浙江':['请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择','请选择'],
        '中国未识别地区':['请选择'],
    }

    $.each(province, function (k,v) {
        console.log(v[0]);
    })
});